{
  "label": "Lancer 系統文件",
  "entries": {
    "LANCER System Information": {
      "name": "LANCER 系統文件",
      "pages": {
        "Migrating from Earlier Versions": {
          "name": "從早期版本升級",
          "text": "<div class=\"desc-text\"><p><span class=\"horus--subtle\" style=\"white-space:pre\">      WELCOME, LANCER. </span></p> <p><span class=\"horus--subtle\" style=\"white-space:pre\"> PLEASE STAND BY WHILE WE MAKE SOME CHANGES.</span></p> <p><span class=\"horus--subtle\" style=\"white-space:pre\">               (this won't hurt a bit) </span></p></div>\n<p></p>\n<p>If this journal popped up automatically, migration of Actors, Items, Scenes, and Tokens is ongoing in the background.</p>\n<p></p>\n<p><strong>DO NOT LOG OFF OR CLOSE THE GAME WHILE MIGRATIONS ARE IN PROGRESS!</strong></p>\n<p></p>\n<p>Please be patient and wait until you see the notification \"<em>LANCER System Migration to version X.Y.Z completed</em>\".</p><p>\n</p><p>\n</p><p>For more information on what has changed recently, read the other pages in this journal and <a href=\"https://github.com/Eranziel/foundryvtt-lancer/blob/master/CHANGELOG.md\">check the changelog</a>.</p>\n<h2>Migration Troubleshooting</h2>\n<p>If the migration seems to never finish, or if it runs every time you load Foundry, then most likely it is encountering errors during the migration process and not finishing properly. Here are some common issues:</p>\n<ul> <li><b>Unlinked tokens inside of scenes inside of compendiums.</b> If you have a compendium of old scenes from v10 or earlier, you should: <ul><li>import them in your v10 world</li> <li>remove them from the compendium</li> <li>migrate to Lancer 2.X/Foundry v11</li> <li>move them back to the compendium</li> </ul></li> <li><b>Items of invalid types.</b> As detailed in the next page of this journal, the Tag, Manufacturer, Sitrep, Environment, Faction, and Quirk item types have been deprecated in Lancer 2.0. If you had items of these types in your world, they will show up in Settings tab -&gt; Support &amp; Issues -&gt; Document Issues. <ul><li>If you wish to get rid of these items, you can do so by copying the following code into a new script macro and running it, then refreshing the page. <code>game.items.invalidDocumentIds.map(id =&gt; game.items.getInvalid(id).delete())</code></li> </ul></li> <li><b>Some modules can interfere with the migration process.</b> If none of the above apply to you, disable all modules and let the migration finish, then re-enable your desired modules.</li> </ul>"
        },
        "Welcome to Lancer 2.0!": {
          "name": "歡迎使用 Lancer 2.0！",
          "text": "<h2>Migration from 1.X - what you need to know</h2>\n<p>The Lancer system has undergone a fairly significant change since the 1.x versions, including simplifications of most of of the data model, as well as the removal of our machine-minds. More importantly, Foundry has evolved significantly as a platform, allowing us to do a lot of nice cleanup in how we store and work with data. As such, we once again need to migrate! Improvements in how Foundry tracks and validates data should make this a fairly painless operation.</p>\n<p>Unfortunately, your Lancer compendiums will be cleared to prevent issues from old data, so you will need to re-import your LCPs. Some things are also not fully migratable, so you may need to do a bit of reconnecting:</p>\n<ul> <li>Existing mechs may not be set as active mechs for their pilots, and will not get HASE bonuses etc... You can set a pilot's active mech in the \"MECH//ACTIVE\" tab on their sheet.</li> <li>Deployables will likely lose the link to their deployers, and will need to be reconnected.</li><li>Deployable tokens in existing scenes may not be the correct size post-migration.</li> </ul>\n<h2>What Happened to All the Compendiums?</h2>\n<p>We have consolidated the Lancer compendiums, making use of the new feature of folders within compendiums. They are now grouped by which type of actor will use the items in the compendium.</p>\n<p>Also, after lengthy debate, we have trimmed some of the fat in our item types. The following item types are now deprecated:</p>\n<ul> <li><code>tag</code>s - which are now tracked via the world settings for efficiency and consistency.</li> <li><code>manufacturer</code>s - which never really warranted an \"item\", and are now just a string on licensed items.</li> <li><code>sitreps</code>s - which were barely supported to begin with, and didn't make sense to keep as an item.</li> <li><code>environments</code>s - which may see an eventual return, were not supported or implemented to our liking.</li> <li><code>factions</code>s - which may see an eventual return as a journal entry type when those are supported</li> <li><code>quirks</code>s - which seemed to fit better as just a text box.</li> </ul>"
        },
        "Acknowledgements & Legal": {
          "name": "致謝 & 法律授權",
          "text": "<h2>致謝</h2><p><span>特別感謝 <a class=\"center\" href=\"https://www.retrogrademinis.com/\">Retrograde Minis</a> 提供我們預設的角色美術圖。</span></p><div style=\"text-align:center;margin-top:.5em\" class=\"flex-center\"><a href=\"https://www.retrogrademinis.com/\"><img src=\"https://retrograde-minis.nyc3.digitaloceanspaces.com/text/retrograde-logo.png\" alt=\"Retrograde Minis\" /></a></div><p></p><h2>法律授權</h2><p>「Lancer for FoundryVTT」並不是 <em>《槍騎兵 (Lancer)》</em> 的官方產品；這個模組屬於第三方作品，且與 Massif Press 並無關連。「Lancer for FoundryVTT」依據 <em>Lancer</em> 的第三方授權規定發布。</p><p><em>《槍騎兵 (Lancer)》</em>的版權歸屬於 Massif Press。</p><div style=\"text-align:center\"><a href=\"https://massifpress.com/legal\"><img src=\"https://massifpress.com/_next/image?url=%2Fimages%2Flegal%2Fpowered_by_Lancer-01.svg&amp;w=640&amp;q=75\" alt=\"Powered by Lancer\" /></a></div>"
        }
      }
    }
  }
}